<a href="https://colab.research.google.com/github/Olamyyde/test-colab/blob/master/161_170_exercises.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

## Pandas

### Table of contents:
* [Import biblioteki](#0)
* [Exercise 161](#1)
* [Exercise 162](#2)
* [Exercise 163](#3)
* [Exercise 164](#4)
* [Exercise 165](#5)
* [Exercise 166](#6)
* [Exercise 167](#7)
* [Exercise 168](#8)
* [Exercise 169](#9)
* [Exercise 170](#10)

### <a name='0'></a> Import of libraries

In [1]:
import numpy as np
import pandas as pd

pd.options.display.float_format = '{:.2f}'.format
np.__version__

'1.18.5'

### <a name='1'></a> Exercise 161
Load the csv file into the _DataFrame_ object named _df_:

* https://storage.googleapis.com/esmartdata-courses-files/dash-course/data.csv

Set the index to the first column. Display object _df_.

In [2]:
# enter solution here
df=pd.read_csv('https://storage.googleapis.com/esmartdata-courses-files/dash-course/data.csv', index_col=0)
df

                                  Name    Location  ...  New_Price  Price
0               Maruti Wagon R LXI CNG      Mumbai  ...        NaN   1.75
1     Hyundai Creta 1.6 CRDi SX Option        Pune  ...        NaN  12.50
2                         Honda Jazz V     Chennai  ...  8.61 Lakh   4.50
3                    Maruti Ertiga VDI     Chennai  ...        NaN   6.00
4      Audi A4 New 2.0 TDI Multitronic  Coimbatore  ...        NaN  17.74
...                                ...         ...  ...        ...    ...
6014                  Maruti Swift VDI       Delhi  ...  7.88 Lakh   4.75
6015          Hyundai Xcent 1.1 CRDi S      Jaipur  ...        NaN   4.00
6016             Mahindra Xylo D4 BSIV      Jaipur  ...        NaN   2.90
6017                Maruti Wagon R VXI     Kolkata  ...        NaN   2.65
6018             Chevrolet Beat Diesel   Hyderabad  ...        NaN   2.50

[6019 rows x 13 columns]

Display information about the object _df_.

In [3]:
# enter solution here
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 6019 entries, 0 to 6018
Data columns (total 13 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Name               6019 non-null   object
 1   Location           6019 non-null   object
 2   Year               6019 non-null   int64
 3   Kilometers_Driven  6019 non-null   int64
 4   Fuel_Type          6019 non-null   object
 5   Transmission       6019 non-null   object
 6   Owner_Type         6019 non-null   object
 7   Mileage            6017 non-null   object
 8   Engine             5983 non-null   object
 9   Power              5983 non-null   object
 10  Seats              5977 non-null   float64
 11  New_Price          824 non-null    object
 12  Price              6019 non-null   float64
dtypes: float64(2), int64(2), object(9)
memory usage: 658.3+ KB

Display basic statistics of an object _df_.

In [4]:
# enter solution here
df.describe()

         Year  Kilometers_Driven   Seats   Price
count 6019.00            6019.00 5977.00 6019.00
mean  2013.36           58738.38    5.28    9.48
std      3.27           91268.84    0.81   11.19
min   1998.00             171.00    0.00    0.44
25%   2011.00           34000.00    5.00    3.50
50%   2014.00           53000.00    5.00    5.64
75%   2016.00           73000.00    5.00    9.95
max   2019.00         6500000.00   10.00  160.00

### <a name='2'></a> Exercise 162
Find the list containing the names of all columns of the _df_ object.

In [5]:
# enter solution here
list(df.columns)

['Name',
 'Location',
 'Year',
 'Kilometers_Driven',
 'Fuel_Type',
 'Transmission',
 'Owner_Type',
 'Mileage',
 'Engine',
 'Power',
 'Seats',
 'New_Price',
 'Price']

From the df object, remove the column named New_Price and display the first 5 rows.

In [6]:
# enter solution here
df.drop('New_Price', axis=1, inplace=True)
df.head()

                               Name    Location  Year  ...      Power Seats Price
0            Maruti Wagon R LXI CNG      Mumbai  2010  ...  58.16 bhp  5.00  1.75
1  Hyundai Creta 1.6 CRDi SX Option        Pune  2015  ...  126.2 bhp  5.00 12.50
2                      Honda Jazz V     Chennai  2011  ...   88.7 bhp  5.00  4.50
3                 Maruti Ertiga VDI     Chennai  2012  ...  88.76 bhp  7.00  6.00
4   Audi A4 New 2.0 TDI Multitronic  Coimbatore  2013  ...  140.8 bhp  5.00 17.74

[5 rows x 12 columns]

### <a name='3'></a> Exercise 163
Find the number of missing values for each object variable _df_.

In [7]:
# enter solution here
df.isnull().sum()

Name                  0
Location              0
Year                  0
Kilometers_Driven     0
Fuel_Type             0
Transmission          0
Owner_Type            0
Mileage               2
Engine               36
Power                36
Seats                42
Price                 0
dtype: int64

Delete all rows with missing values in the _df_ object. Use the `inplace = True` parameter.

In [8]:
# enter solution here
df.dropna(inplace=True)

### <a name='4'></a> Exercise 164
Replace all letters in column names with lowercase letters, e.g.
* Name -> name
* Fuel_Type -> fuel_type

Display the first five rows using the _head()_ method.

In [21]:
# enter solution here
df.columns = [col.lower() for col in df.columns]
df.head()

                               name    location  year  ...      power seats price
0            Maruti Wagon R LXI CNG      Mumbai  2010  ...  58.16 bhp  5.00  1.75
1  Hyundai Creta 1.6 CRDi SX Option        Pune  2015  ...  126.2 bhp  5.00 12.50
2                      Honda Jazz V     Chennai  2011  ...   88.7 bhp  5.00  4.50
3                 Maruti Ertiga VDI     Chennai  2012  ...  88.76 bhp  7.00  6.00
4   Audi A4 New 2.0 TDI Multitronic  Coimbatore  2013  ...  140.8 bhp  5.00 17.74

[5 rows x 12 columns]

### <a name='5'></a> Exercise 165
Find the distribution of the _owner_type_ variable.

In [22]:
# enter solution here
df['owner_type'].value_counts()

First             4903
Second             953
Third              111
Fourth & Above       8
Name: owner_type, dtype: int64

Find the distribution of the _engine_ variable.

In [23]:
# enter solution here
df['engine'].value_counts()

1197 CC    606
1248 CC    512
1498 CC    303
998 CC     259
2179 CC    240
          ...
5204 CC      1
2995 CC      1
4951 CC      1
2773 CC      1
2720 CC      1
Name: engine, Length: 145, dtype: int64

Note that the variable _engine_ is of type _object_. Remove the last 3 characters from each element and convert to _int_. Display the first five rows using the _head()_ method.

In [24]:
# enter solution here
df['engine'] = df['engine'].map(lambda x: int(x[:-3]))
df.head()

                               name    location  year  ...      power seats price
0            Maruti Wagon R LXI CNG      Mumbai  2010  ...  58.16 bhp  5.00  1.75
1  Hyundai Creta 1.6 CRDi SX Option        Pune  2015  ...  126.2 bhp  5.00 12.50
2                      Honda Jazz V     Chennai  2011  ...   88.7 bhp  5.00  4.50
3                 Maruti Ertiga VDI     Chennai  2012  ...  88.76 bhp  7.00  6.00
4   Audi A4 New 2.0 TDI Multitronic  Coimbatore  2013  ...  140.8 bhp  5.00 17.74

[5 rows x 12 columns]

### <a name='6'></a> Exercise 166
Look at the distribution of the _power_ variable. Note that this variable also has missing values in the form of the _'null bhp'_ value. Replace these values for _power_ with _np.nan_. Use the _np.where()_ function for this.

In [25]:
# enter solution here
df['power'] = np.where(df['power'] == 'null bhp', np.nan, df['power'])

Delete all rows with missing values again.

In [27]:
# enter solution here
df.dropna(inplace=True)

### <a name='7'></a> Exercise 167
Note that the _power_ variable is of type _object_. Remove the last 4 characters from each element and convert to float type.

Display the first five rows using the _head()_ method.

In [28]:
# enter solution here
df['power'] = df['power'].map(lambda x: float(x[:-4]))
df.head()

                               name    location  year  ...  power seats price
0            Maruti Wagon R LXI CNG      Mumbai  2010  ...  58.16  5.00  1.75
1  Hyundai Creta 1.6 CRDi SX Option        Pune  2015  ... 126.20  5.00 12.50
2                      Honda Jazz V     Chennai  2011  ...  88.70  5.00  4.50
3                 Maruti Ertiga VDI     Chennai  2012  ...  88.76  7.00  6.00
4   Audi A4 New 2.0 TDI Multitronic  Coimbatore  2013  ... 140.80  5.00 17.74

[5 rows x 12 columns]

### <a name='8'></a> Exercise 168
Group data at year level (_year_) and count the number of rows for each year.

In [29]:
# enter solution here
df.groupby('year').size()

year
1998      3
1999      2
2000      4
2001      4
2002     11
2003     14
2004     25
2005     42
2006     66
2007    105
2008    162
2009    191
2010    333
2011    452
2012    562
2013    639
2014    794
2015    740
2016    737
2017    586
2018    298
2019    102
dtype: int64

### <a name='9'></a> Exercise 169
Check the distribution of the _transmission_ variable.

In [30]:
# enter solution 
df['transmission'].value_counts()

Manual       4170
Automatic    1702
Name: transmission, dtype: int64

Perform the following mapping of the _transmission_ variable:
* Manual -> 0
* Automatic -> 1

Display the first five rows using the _head()_ method.

In [31]:
# enter solution here
df['transmission'] = df['transmission'].map({'Manual':0, 'Automatic':1})
df.head()

                               name    location  year  ...  power seats  price
0            Maruti Wagon R LXI CNG      Mumbai  2010  ...  58.16  5.00   1.75
1  Hyundai Creta 1.6 CRDi SX Option        Pune  2015  ... 126.20  5.00  12.50
2                      Honda Jazz V     Chennai  2011  ...  88.70  5.00   4.50
3                 Maruti Ertiga VDI     Chennai  2012  ...  88.76  7.00   6.00
4   Audi A4 New 2.0 TDI Multitronic  Coimbatore  2013  ... 140.80  5.00  17.74

[5 rows x 12 columns]

### <a name='10'></a> Exercise 170
Save the _df_ object to the _car.csv_ file (do not save the index).

In [32]:
# enter solution here
df.to_csv('car.csv', index=False)

Run the following instructions to check.

In [33]:
!head car.csv

name,location,year,kilometers_driven,fuel_type,transmission,owner_type,mileage,engine,power,seats,price
Maruti Wagon R LXI CNG,Mumbai,2010,72000,CNG,0,First,26.6 km/kg,998,58.16,5.0,1.75
Hyundai Creta 1.6 CRDi SX Option,Pune,2015,41000,Diesel,0,First,19.67 kmpl,1582,126.2,5.0,12.5
Honda Jazz V,Chennai,2011,46000,Petrol,0,First,18.2 kmpl,1199,88.7,5.0,4.5
Maruti Ertiga VDI,Chennai,2012,87000,Diesel,0,First,20.77 kmpl,1248,88.76,7.0,6.0
Audi A4 New 2.0 TDI Multitronic,Coimbatore,2013,40670,Diesel,1,Second,15.2 kmpl,1968,140.8,5.0,17.74
Hyundai EON LPG Era Plus Option,Hyderabad,2012,75000,LPG,0,First,21.1 km/kg,814,55.2,5.0,2.35
Nissan Micra Diesel XV,Jaipur,2013,86999,Diesel,0,First,23.08 kmpl,1461,63.1,5.0,3.5
Toyota Innova Crysta 2.8 GX AT 8S,Mumbai,2016,36000,Diesel,1,First,11.36 kmpl,2755,171.5,8.0,17.5
Volkswagen Vento Diesel Comfortline,Pune,2013,64430,Diesel,0,First,20.54 kmpl,1598,103.6,5.0,5.2